app/Controllers/Admin/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_blocked` = 1
---
    public function index()
    {
        $db = \Config\Database::connect();

        $data['total_users'] = $db->table('users')->countAllResults();

        $data['total_ads'] = $db->table('ads')->countAllResults();

        $data['active_ads'] = $db->table('ads')
            ->where('status', 1)
            ->countAllResults();

        $data['total_blocked_users'] = $db->table('users')
            ->where('is_blocked', 1)
            ->countAllResults();

SELECT `a`.*, `g`.`group_name`
FROM `admin` `a`
LEFT JOIN `tbl_group` `g` ON `g`.`group_id` = `a`.`group_id`
ORDER BY `a`.`user_id` ASC
---
    public function admins()
    {
        $db = \Config\Database::connect();

        $data['admins'] = $db->table('admin a')
            ->select('a.*, g.group_name')
            ->join('tbl_group g', 'g.group_id = a.group_id', 'left')
            ->orderBy('a.user_id', 'ASC')
            ->get()
            ->getResult();

SELECT *
FROM `tbl_group`
WHERE `status` = 1
---
    public function addAdmin()
    {
        if (!session()->get('userlogin')) {
            return redirect()->to('/admin');
        }

        $db = \Config\Database::connect();

        // Group list dropdown ke liye
        $data['groups'] = $db->table('tbl_group')
            ->where('status', 1)
            ->get()
            ->getResult();

SELECT *
FROM `users`
ORDER BY `user_id` ASC
---
    public function users()
    {
        if (!session()->get('userlogin')) {
            return redirect()->to('/wpsadmin');
        }

        $db = \Config\Database::connect();

        $data['users'] = $db->table('users')
            ->orderBy('user_id', 'ASC')
            ->get()
            ->getResult();