app/Views/admin/index.php

<?= $this->section("content") ?>

<?php
$recentUsers = \Config\Database::connect()
  ->table('users')
  ->orderBy('user_id', 'DESC')
  ->limit(5)
  ->get()
  ->getResult();
---
SELECT *
FROM `users`
ORDER BY `user_id` DESC
 LIMIT 5