app/Views/users/dashboard.php

SELECT *
FROM `users`
WHERE `id` = '1'
---
    ->get()->getResult();

// User details fetch karna image ke liye
$user = $db->table('users')->where('id', $my_id)->get()->getRow();