app/Models/AuthModel.php

    public function isvalidate($email)
    {
        //$pass=md5($password);
        $builder = $this->db->table($this->adminTbl);
        $builder->where('email', $email);
        $builder->where('status', 1);
        $query = $builder->get();
---
SELECT *
FROM `admin`
WHERE `email` = 'brajesh@gmail.com'
AND `status` = 1

    public function is_users_validate($email)
    {
        $builder = $this->db->table($this->usersTbl); // users table
        $builder->where('email', $email);
        $builder->where('status', 1);
        $query = $builder->get();
---
SELECT *
FROM `users`
WHERE `email` = 'sa@gmail.com'
AND `status` = 1

    public function is_user_privilege($groupId, $menuId)
{
    return $this->db->table('tbl_group_privilege')
        ->where('group_id', $groupId)
        ->where('menu_id', $menuId)
        ->get()
        ->getRow();
---
SELECT *
FROM `tbl_group_privilege`
WHERE `group_id` = '1'
AND `menu_id` = 1