app/Views/_layout/navbar.php

$unreadCount = 0;

if ($my_session_id) {
    $unreadCount = $db->table('messages')
        ->where('receiver_id', $my_session_id)
        ->where('is_read', 0)
        ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `messages`
WHERE `receiver_id` = '1'
AND `is_read` = 0